app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'student@gmail.com'
 LIMIT 1
---
        }

        // Find user using Query Builder (SQL injection prevention)
        $user = $this->userModel->where('email', $email)->first();