app/Controllers/Auth.php

    protected function handleLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[8]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'teacher@gmail.com'
 LIMIT 1